tests/failover-load-test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<!--
  JMeter 5.6 Load Test Plan: AI-as-a-Service — Failover Blast (AppGW → APIM retry)
  ===================================================================================

  PURPOSE
  =======
  Saturate the primary Foundry endpoint (10K TPM cap) as fast as possible so APIM's
  failover-retry policy retries on the secondary endpoint.  Clients should always see
  HTTP 200; the X-Backend-Region-Used response header reveals which backend actually
  served the request.

  Traffic path:
    JMeter → AppGW WAF v2 (HTTPS 443) → APIM (openai-inference API) →
      [429/5xx] → APIM retries → secondary Foundry → 200 to client
                 X-Backend-Region-Used: secondary-failover

  TEST DESIGN
  ===========
  20 threads, NO think time, 2-minute scheduler.
  Tiny payload (max_tokens=1) maximises RPS → saturates 10K TPM quickly.
  At ~20-50 RPS the primary 429s within seconds; APIM retries on secondary.

  ASSERTIONS
  ==========
  1. HTTP 200 — APIM transparent retry means client always sees 200.
  2. X-Backend-Region-Used header is captured by Regex Extractor and logged.
  3. tearDown JSR223 Sampler reports how many responses came from "secondary-failover".

  PREREQUISITES (Azure Load Testing)
  ===================================
  ALT env vars (same as appgw-load-test):
    APIM_HOSTNAME = agw-contoso-ai-primary.eastus.cloudapp.azure.com
    API_VERSION   = 2024-10-21
    SILVER_KEY    = <silver subscription key>

  Additional uploaded files:
    appgw-system.properties — javax.net.ssl.trustStore=NONE (re-used from smoke test)

  POLICY REQUIREMENT
  ==================
  policies/apim/failover-retry.xml must be active on the openai-inference API
  (deployed by run-failover-test.ps1 before the test run, reverted after).
-->
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan"
              testname="AI-as-a-Service Failover Blast — APIM Primary→Secondary Retry" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>

      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments"
                   guiclass="ArgumentsPanel" testclass="Arguments">
        <collectionProp name="Arguments.arguments">
          <elementProp name="APIM_HOSTNAME" elementType="Argument">
            <stringProp name="Argument.name">APIM_HOSTNAME</stringProp>
            <stringProp name="Argument.value">${__P(APIM_HOSTNAME,agw-contoso-ai-primary.eastus.cloudapp.azure.com)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="API_VERSION" elementType="Argument">
            <stringProp name="Argument.name">API_VERSION</stringProp>
            <stringProp name="Argument.value">${__P(API_VERSION,2024-10-21)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="SILVER_KEY" elementType="Argument">
            <stringProp name="Argument.name">SILVER_KEY</stringProp>
            <stringProp name="Argument.value">${__P(SILVER_KEY,)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ================================================================= -->
      <!-- setUp: Trust-all SSL + inject env vars into JMeter props           -->
      <!-- Copied verbatim from appgw-load-test.jmx setUp — same pattern.    -->
      <!-- ================================================================= -->
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup"
                        testname="[Setup] Install trust-all SSL for AppGW self-signed cert"
                        enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">stoptest</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
      </SetupThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler"
                       testname="Trust-all SSL context (AppGW self-signed cert)" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
import javax.net.ssl.*
import java.security.*
import java.security.cert.X509Certificate

System.setProperty("javax.net.ssl.trustStore",         "NONE")
System.setProperty("javax.net.ssl.trustStoreType",     "JKS")
System.setProperty("javax.net.ssl.trustStorePassword", "")

try {
    def sslManager = Class.forName("org.apache.jmeter.util.SSLManager")
                          .getDeclaredMethod("getInstance").invoke(null)
    def ctxField = Class.forName("org.apache.jmeter.util.JsseSSLManager")
                        .getDeclaredField("defaultContext")
    ctxField.setAccessible(true)
    ctxField.set(sslManager, null)
    log.info("[AppGW SSL] JsseSSLManager.defaultContext reset — trust-all active")
} catch (Exception e) {
    log.info("[AppGW SSL] JsseSSLManager reset skipped: " + e.message)
}

def trustAll = [
    checkClientTrusted: { chain, authType -> },
    checkServerTrusted: { chain, authType -> },
    getAcceptedIssuers: { [] as X509Certificate[] }
] as X509TrustManager

def sc = SSLContext.getInstance("TLS")
sc.init(null, [trustAll] as TrustManager[], new SecureRandom())
SSLContext.setDefault(sc)
HttpsURLConnection.setDefaultSSLSocketFactory(sc.getSocketFactory())
HttpsURLConnection.setDefaultHostnameVerifier({ hostname, session -> true } as HostnameVerifier)

// Initialise shared failover counter (thread-safe AtomicInteger in JMeter props).
props.put("failoverCount", new java.util.concurrent.atomic.AtomicInteger(0))
props.put("primaryCount",  new java.util.concurrent.atomic.AtomicInteger(0))
props.put("totalCount",    new java.util.concurrent.atomic.AtomicInteger(0))

['SILVER_KEY', 'APIM_HOSTNAME', 'API_VERSION'].each { varName ->
    def current = props.get(varName)
    if (current != null &amp;&amp; current.length() &gt; 0) {
        log.info("[Config] " + varName + " already set (len=" + current.length() + ")")
    } else {
        def fromEnv = System.getenv(varName)
        if (fromEnv != null &amp;&amp; fromEnv.length() &gt; 0) {
            props.put(varName, fromEnv)
            log.info("[Config] " + varName + " loaded from OS env (len=" + fromEnv.length() + ")")
        } else {
            log.warn("[Config] " + varName + " MISSING — test will fail!")
        }
    }
}

log.info("[Failover] Failover blast setUp complete. Firing 20 threads with no think time.")
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

      <!-- ================================================================= -->
      <!-- Suite 1: Failover Blast — 20 threads, no think time, 120 s        -->
      <!--                                                                     -->
      <!-- 20 threads × no delay → ~20-50 RPS → saturates 10K TPM primary   -->
      <!-- APIM retries on secondary → client sees 200                       -->
      <!-- X-Backend-Region-Used header shows "secondary-failover" on retry  -->
      <!-- ================================================================= -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup"
                   testname="[Failover] Blast gpt-4o-mini — saturate primary TPM" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">true</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">120</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>

        <!-- Auth + standard OWASP-bypass headers -->
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager"
                       testname="Silver Auth + OWASP headers" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="Ocp-Apim-Subscription-Key" elementType="Header">
              <stringProp name="Header.name">Ocp-Apim-Subscription-Key</stringProp>
              <stringProp name="Header.value">${SILVER_KEY}</stringProp>
            </elementProp>
            <elementProp name="Content-Type" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="Accept" elementType="Header">
              <stringProp name="Header.name">Accept</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
            <elementProp name="User-Agent" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>

        <!--
          5-second think time: gives ~4 RPS with 20 threads.  Primary is
          temporarily capped at 1K TPM by run-failover-test.ps1, so it 429s
          within ~15 seconds.  Secondary sees the overflow (~3,600 TPM at
          max_tokens=1), well within its 10K TPM cap.
        -->
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer"
                       testname="Think Time — paced (policy handles failover routing)" enabled="true">
          <stringProp name="ConstantTimer.delay">5000</stringProp>
        </ConstantTimer>
        <hashTree/>

        <!-- Minimal payload: 1 token response to maximise event count while staying safe on TPM -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy"
                          testname="POST /openai/deployments/gpt-4o-mini/chat/completions"
                          enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"messages":[{"role":"user","content":"Hi"}],"max_tokens":1}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">${APIM_HOSTNAME}</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/openai/deployments/gpt-4o-mini/chat/completions?api-version=${API_VERSION}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>

          <!-- Assert APIM-transparent-retry delivers 200 to client -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion"
                             testname="Assert 200 — APIM retry must shield client from 429" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="49586">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Client must always see 200 — APIM retries 429 on secondary transparently</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_code</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">8</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- Extract X-Backend-Region-Used response header into JMeter var -->
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor"
                          testname="Extract X-Backend-Region-Used header" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">true</stringProp>
            <stringProp name="RegexExtractor.refname">backendRegion</stringProp>
            <stringProp name="RegexExtractor.regex">X-Backend-Region-Used: (.+?)[\r\n]</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
            <stringProp name="RegexExtractor.default">primary</stringProp>
            <stringProp name="RegexExtractor.match_no">1</stringProp>
          </RegexExtractor>
          <hashTree/>

          <!-- Increment shared failover/primary counters -->
          <JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor"
                               testname="Track failover vs primary counter" enabled="true">
            <stringProp name="scriptLanguage">groovy</stringProp>
            <stringProp name="script">
def region = vars.get("backendRegion") ?: "primary"
def total    = props.get("totalCount")
def primary  = props.get("primaryCount")
def failover = props.get("failoverCount")

if (total    != null) total.incrementAndGet()
if (region.contains("secondary")) {
    if (failover != null) failover.incrementAndGet()
} else {
    if (primary  != null) primary.incrementAndGet()
}
            </stringProp>
          </JSR223PostProcessor>
          <hashTree/>

        </hashTree>
      </hashTree>

      <!-- ================================================================= -->
      <!-- tearDown: Report failover count summary                            -->
      <!-- ================================================================= -->
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup"
                       testname="[tearDown] Report failover statistics" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController"
                     guiclass="LoopControlPanel" testclass="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
      </PostThreadGroup>
      <hashTree>
        <JSR223Sampler guiclass="TestBeanGUI" testclass="JSR223Sampler"
                       testname="[Summary] Failover statistics" enabled="true">
          <stringProp name="scriptLanguage">groovy</stringProp>
          <stringProp name="script">
def total    = (props.get("totalCount")    as java.util.concurrent.atomic.AtomicInteger)?.get() ?: 0
def primary  = (props.get("primaryCount")  as java.util.concurrent.atomic.AtomicInteger)?.get() ?: 0
def failover = (props.get("failoverCount") as java.util.concurrent.atomic.AtomicInteger)?.get() ?: 0
def pct      = total &gt; 0 ? String.format("%.1f", (failover / (double)total) * 100) : "0.0"

def msg = """
=== FAILOVER BLAST RESULTS ===
Total requests   : ${total}
Primary (served) : ${primary}
Failover hits    : ${failover}  (${pct}% of total)
================================
${failover > 0 ? "PASS — APIM successfully failed over to secondary endpoint" : "INFO — No failover observed. Increase threads or check policy."}
"""
log.info(msg)
SampleResult.setResponseData(msg, "UTF-8")
SampleResult.setResponseCodeOK()
SampleResult.setSampleLabel("Failover summary: " + failover + "/" + total + " (" + pct + "%)")
          </stringProp>
        </JSR223Sampler>
        <hashTree/>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>